k6/results/log-smoke_20260527_183352.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/scenarios/smoke/smoke.test.js
        output: InfluxDBv1 (http://localhost:8086)

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1 iterations shared among 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2026-05-27T18:33:52-03:00" level=info msg="▶ [1/13] GET / — Root endpoint" source=console

running (00m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m01.0s/10m0s  0/1 shared iters
time="2026-05-27T18:33:53-03:00" level=info msg="▶ [2/13] GET /health — Health check" source=console
time="2026-05-27T18:33:54-03:00" level=info msg="▶ [3/13] GET /communities — Listar comunidades" source=console

running (00m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m02.0s/10m0s  0/1 shared iters
time="2026-05-27T18:33:54-03:00" level=info msg="▶ [4/13] GET /communities?biomeId=... — Filtrar por bioma" source=console
time="2026-05-27T18:33:55-03:00" level=info msg="▶ [5/13] POST /auth/login — Login com usuário seed" source=console
time="2026-05-27T18:33:55-03:00" level=error msg="❌ Login falhou — abortando smoke test" source=console


  █ THRESHOLDS 

    checks
    ✗ 'rate>0.99' rate=85.71%

    http_req_duration
    ✓ 'p(95)<2000' p(95)=103.64ms

    http_req_failed
    ✗ 'rate<0.01' rate=20.00%


  █ TOTAL RESULTS 

    checks_total.......: 14     4.79069/s
    checks_succeeded...: 85.71% 12 out of 14
    checks_failed......: 14.28% 2 out of 14

    ✓ [root] status 200
    ✓ [root] mensagem VERACIS
    ✓ [health] status 200
    ✓ [health] campo status ok
    ✓ [health] tempo de resposta < 500ms
    ✓ [communities] status 200
    ✓ [communities] tem campo data
    ✓ [communities] tempo de resposta < 1s
    ✗ [login] status 200
      ↳  0% — ✓ 0 / ✗ 1
    ✗ [login] mfaRequired false
      ↳  0% — ✓ 0 / ✗ 1
    ✓ [login] tempo de resposta < 2s

    HTTP
    http_req_duration..............: avg=86.64ms min=79.69ms med=80.04ms max=108.24ms p(90)=99.04ms  p(95)=103.64ms
      { expected_response:true }...: avg=88.3ms  min=79.69ms med=82.64ms max=108.24ms p(90)=101.34ms p(95)=104.79ms
    http_req_failed................: 20.00% 1 out of 5
    http_reqs......................: 5      1.710961/s

    EXECUTION
    iteration_duration.............: avg=2.92s   min=2.92s   med=2.92s   max=2.92s    p(90)=2.92s    p(95)=2.92s   
    iterations.....................: 1      0.342192/s
    vus............................: 1      min=1      max=1
    vus_max........................: 1      min=1      max=1

    NETWORK
    data_received..................: 8.0 kB 2.7 kB/s
    data_sent......................: 2.1 kB 722 B/s



running (00m02.9s), 0/1 VUs, 1 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  00m02.9s/10m0s  1/1 shared iters
time="2026-05-27T18:33:56-03:00" level=error msg="thresholds on metrics 'checks, http_req_failed' have been crossed"